CSI API ETABS v1
cDCompColAISC360_22.GetPreference Method
 Retrieves the value of a composite column design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDCompColAISC360_22
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 18, inclusive, indicating the preference item considered.
Multi-response case design
Design provision
Analysis Method
Second Order Method
Stiffness Reduction Method
Notional load coefficient
Phi bending
Phi compression
Phi tension yielding
Phi tension fracture
Phi shear
Phi shear sort webbed rolled I
Phi torsion
Phi shear reinforced concrete
HSS welding type
Reduce HSS thickness
Pattern live load factor
Demand/capacity ratio limit
Value
Type: System.Double
 The value of the considered preference item.
 Multi-response case design
1 - Envelopes
2 - Step-by-step
3 - Last step
4 - Envelopes -- All
5 - Step-by-step -- All
 Design provision
1 - LRFD
2 - ASD
 Analysis Method
1 - Direct Analysis
2 - Effective Length
3 - Limited 1st Order
 Second Order Method
1 - General 2nd Order
2 - Amplified 1st Order
 Stiffness Reduction Method
1 - Tau-b variable
2 - Tau-b Fixed
3 - No Modification
 Notional load coefficient
Value > 0
 Phi bending
Value > 0
 Phi compression
Value > 0
 Phi tension yielding
Value > 0
 Phi tension fracture
Value > 0
 Phi shear
Value > 0
 Phi shear sort webbed rolled I
Value > 0
 Phi torsion
Value > 0
 Phi shear reinforced concrete
Value > 0
 HSS welding type
1 - ERW
2 - SAW
 Reduce HSS thickness
0 = No
Any other value = Yes
 Pattern live load factor
Value > 0
 Demand/capacity ratio limit
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 '''
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set composite column design code
   ret = SapModel.DesignCompositeColumn.SetCode("AISC 360-22")
'set overwrite item
   ret = SapModel.DesignCompositeColumn.AISC360_22.GetPreference(2, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColAISC360_22 Interface
ETABSv1 Namespace